#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # digitalocean_kubernetes_cluster.foreign_language_reader must be replaced
-/+ resource "digitalocean_kubernetes_cluster" "foreign_language_reader" {
      ~ cluster_subnet = "10.244.0.0/16" -> (known after apply)
      ~ created_at     = "2020-03-14 05:17:12 +0000 UTC" -> (known after apply)
      ~ endpoint       = "https://a5be20d1-0248-460b-a1e1-355d6a5a8c64.k8s.ondigitalocean.com" -> (known after apply)
      ~ id             = "a5be20d1-0248-460b-a1e1-355d6a5a8c64" -> (known after apply)
      ~ ipv4_address   = "138.197.215.0" -> (known after apply)
      ~ kube_config    = (sensitive value)
        name           = "foreign-language-reader"
        region         = "sfo2"
      ~ service_subnet = "10.245.0.0/16" -> (known after apply)
      ~ status         = "running" -> (known after apply)
        tags           = [
            "prod",
        ]
      ~ updated_at     = "2020-03-15 07:46:27 +0000 UTC" -> (known after apply)
        version        = "1.16.6-do.0"

      ~ node_pool {
          ~ actual_node_count = 4 -> (known after apply)
            auto_scale        = true
          ~ id                = "0ce7a921-e37b-4eb0-9229-24e9ab8949c0" -> (known after apply)
            max_nodes         = 4
            min_nodes         = 2
            name              = "worker-pool"
          - node_count        = 0 -> null
          ~ nodes             = [
              - {
                  - created_at = "2020-03-14 09:04:32 +0000 UTC"
                  - droplet_id = "184746936"
                  - id         = "53a7ce56-8df2-4457-9e7b-b69b4f5c9ad9"
                  - name       = "worker-pool-1h7n"
                  - status     = "running"
                  - updated_at = "2020-03-14 09:05:51 +0000 UTC"
                },
              - {
                  - created_at = "2020-03-14 09:37:55 +0000 UTC"
                  - droplet_id = "184749657"
                  - id         = "aacc48df-ad72-40c3-8acf-de8f786f6d94"
                  - name       = "worker-pool-1hqq"
                  - status     = "deleting"
                  - updated_at = "2020-03-15 07:30:15 +0000 UTC"
                },
              - {
                  - created_at = "2020-03-14 09:37:55 +0000 UTC"
                  - droplet_id = "184749656"
                  - id         = "fccad2dd-aac5-4469-bd1c-6a702b5ae491"
                  - name       = "worker-pool-1hqf"
                  - status     = "running"
                  - updated_at = "2020-03-14 09:40:35 +0000 UTC"
                },
              - {
                  - created_at = "2020-03-15 00:01:13 +0000 UTC"
                  - droplet_id = "184834543"
                  - id         = "c904f368-faa0-406e-a5fb-48a35d95e096"
                  - name       = "worker-pool-1458"
                  - status     = "running"
                  - updated_at = "2020-03-15 00:03:54 +0000 UTC"
                },
            ] -> (known after apply)
          ~ size              = "s-1vcpu-2gb" -> "s-2vcpu-4gb" # forces replacement
          - tags              = [] -> null
        }
    }

  # module.infrastructure.module.kubernetes_config.helm_release.elasticsearch is tainted, so must be replaced
-/+ resource "helm_release" "elasticsearch" {
        atomic                = false
        chart                 = "elasticsearch"
        cleanup_on_fail       = false
        dependency_update     = false
        disable_crd_hooks     = false
        disable_webhooks      = false
        force_update          = false
      ~ id                    = "elasticsearch" -> (known after apply)
        max_history           = 0
      ~ metadata              = [
          - {
              - chart     = "elasticsearch"
              - name      = "elasticsearch"
              - namespace = "default"
              - revision  = 1
              - values    = "null"
              - version   = "7.6.1"
            },
        ] -> (known after apply)
        name                  = "elasticsearch"
        namespace             = "default"
        recreate_pods         = false
        render_subchart_notes = true
        replace               = false
        repository            = "https://helm.elastic.co"
        reset_values          = false
        reuse_values          = false
        skip_crds             = false
        status                = "deployed"
        timeout               = 300
        verify                = false
        version               = "7.6.1"
        wait                  = true
    }

  # module.infrastructure.module.kubernetes_config.helm_release.kibana will be created
  + resource "helm_release" "kibana" {
      + atomic                = false
      + chart                 = "kibana"
      + cleanup_on_fail       = false
      + dependency_update     = false
      + disable_crd_hooks     = false
      + disable_webhooks      = false
      + force_update          = false
      + id                    = (known after apply)
      + max_history           = 0
      + metadata              = (known after apply)
      + name                  = "kibana"
      + namespace             = "default"
      + recreate_pods         = false
      + render_subchart_notes = true
      + replace               = false
      + repository            = "https://helm.elastic.co"
      + reset_values          = false
      + reuse_values          = false
      + skip_crds             = false
      + status                = "deployed"
      + timeout               = 300
      + verify                = false
      + version               = "7.6.1"
      + wait                  = true
    }

Plan: 3 to add, 0 to change, 2 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "api_secret_key_base" but a
value was found in file "/terraform/terraform.tfvars". To use this value, add
a "variable" block to the configuration.

Using a variables file to set an undeclared variable is deprecated and will
become an error in a future release. If you wish to provide certain "global"
settings to all configurations in your organization, use TF_VAR_...
environment variables to set these instead.

```

</details>

*Workflow: `Test infrastructure plan`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`, Workspace: `default`*
